#include <stdio.h>
#include <stdlib.h>

int main()
{
	system("chcp 1251");
	system("cls");



	char sc1[2], sc2[2], sc3[2];
	int relMass1;
	double relMass2, relMass3;
	double procPart1, procPart2, procPart3;
	unsigned long numbOfStars1, numbOfStars2, numbOfStars3;

	printf("1. Введите: спектральный класс, Приблизительную массу(отн.Солнца), Часть, Численность:");
	scanf_s("%s %d %lf %lu", sc1, &relMass1, &procPart1, &numbOfStars1);

	printf("2. Введите: спектральный класс, Приблизительную массу(отн.Солнца), Часть, Численность:");
	scanf_s("%s %f %lf %lu", sc2, &relMass2, &procPart2, &numbOfStars2);

	printf("3. Введите: спектральный класс, Приблизительную массу(отн.Солнца), Часть, Численность:");
	scanf_s("%s %f %lf %lu", sc3, &relMass3, &procPart3, &numbOfStars3);

	printf("---------------------------------------------------------------------------\t\n");
	printf("|Приблизительное количество звезд разных спектральных классов в Галактике |\t\n");
	printf("|-------------------------------------------------------------------------|\t\n");
	printf("| Спектральный класс |  Приблизительная масса  | Часть |    Численность   |\t\n");
	printf("|                    |       (отн.Солнца)      |       |                  |\t\n");
	printf("|--------------------|-------------------------|-------|------------------|\t\n");
	printf("|       %s           |           %d            |  %lf  |       %lu        |\t\n,", sc1, relMass1, procPart1, numbOfStars1);
	printf("|--------------------|-------------------------|-------|------------------|\t\n");
	printf("|       %s           |           %d            |  %lf  |       %lu        |\t\n,", sc2, relMass2, procPart2, numbOfStars2);
	printf("|--------------------|-------------------------|-------|------------------|\t\n");
	printf("|       %s           |           %d            |  %lf  |       %lu        |\t\n,", sc3, relMass3, procPart3, numbOfStars3);
	printf("|-------------------------------------------------------------------------|\t\n");
	printf("|Примечание: не показаны данные для классов: B, A, G, K                   |\t\n");
	printf("---------------------------------------------------------------------------\t\n");

}